# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [2]:
import pandas as pd
import sqlite3 
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a dataframe with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [8]:
cur.execute("""SELECT lastName, firstName, city, state FROM employees
            JOIN offices USING(officeCode)
            ORDER BY firstName, lastName
            LIMIT 5;""").fetchall()

[('Fixter', 'Andy', 'Sydney', ''),
 ('Bow', 'Anthony', 'San Francisco', 'CA'),
 ('Jones', 'Barry', 'London', ''),
 ('Murphy', 'Diane', 'San Francisco', 'CA'),
 ('Tseng', 'Foon Yue', 'NYC', 'NY')]

## Customers and their Orders (a One-to-Many join)

Return a dataframe with all of the customers' first and last names along with details for each of their order numbers, order dates, and statuses.

In [9]:
# Your code here
cur.execute("""SELECT contactfirstName, contactlastName, orderNumber, status, orderDate
            FROM customers
            JOIN orders
            USING(customerNumber) LIMIT 5;""").fetchall()

[('Carine ', 'Schmitt', '10123', 'Shipped', '2003-05-20'),
 ('Carine ', 'Schmitt', '10298', 'Shipped', '2004-09-27'),
 ('Carine ', 'Schmitt', '10345', 'Shipped', '2004-11-25'),
 ('Jean', 'King', '10124', 'Shipped', '2003-05-21'),
 ('Jean', 'King', '10278', 'Shipped', '2004-08-06')]

## Customers and their Payments (another One-to-Many join)

Return a dataframe with all of the customers' first and last names along with details about their payments' amount and date of payment. Sort these results in descending order by the payment amount.

In [11]:
# Your code here
cur.execute("""SELECT contactfirstName, contactlastName, amount, paymentDate
            FROM customers
            JOIN payments
            USING(customerNumber) LIMIT 5;""").fetchall()

[('Carine ', 'Schmitt', '14571.44', '2003-06-05'),
 ('Carine ', 'Schmitt', '6066.78', '2004-10-19'),
 ('Carine ', 'Schmitt', '1676.14', '2004-12-18'),
 ('Jean', 'King', '32641.98', '2003-06-06'),
 ('Jean', 'King', '33347.88', '2004-08-20')]

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a dataframe with all of the customers' first and last names along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

- Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [14]:
# Your code here
cur.execute("""SELECT contactfirstName, contactlastName, productName, quantityOrdered, orderDate 
            FROM customers
            JOIN orders
            USING(customerNumber)
            JOIN orderdetails
            USING(orderNumber)
            JOIN products
            USING(productCode)
            ORDER BY orderDate DESC
            LIMIT 5;""").fetchall()

[('Janine ', 'Labrune', '1962 LanciaA Delta 16V', '38', '2005-05-31'),
 ('Janine ', 'Labrune', '1957 Chevy Pickup', '33', '2005-05-31'),
 ('Janine ', 'Labrune', '1998 Chrysler Plymouth Prowler', '28', '2005-05-31'),
 ('Janine ', 'Labrune', '1964 Mercedes Tour Bus', '38', '2005-05-31'),
 ('Janine ', 'Labrune', '1926 Ford Fire Engine', '19', '2005-05-31')]

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!